---
type: ClassificationEntry
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ClassificationEntry

`Autodesk.Revit.DB.ClassificationEntry` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ClassificationEntry | 2015 | `public ClassificationEntry ( string key , string parentKey , string description , int level , ElementId categoryId )` |
| Method | HasBadCategoryId | 2015 | `public bool HasBadCategoryId ()` |
| Method | HasBadLevel | 2015 | `public bool HasBadLevel ()` |
| Method | HasInvalidKey | 2015 | `public bool HasInvalidKey ()` |
| Property | CategoryId | 2015 | `public ElementId CategoryId { get ; }` |
| Property | Description | 2015 | `public string Description { get ; }` |
| Property | Level | 2015 | `public int Level { get ; }` |